oblasti = {"Адыгея", "Алтай", "Алтайский", "Амурская", "Архангельская",
                "Астраханская", "Башкортостан", "Белгородская", "Брянская",
                "Бурятия", "Владимирская", "Волгоградская", "Вологодская", "Воронежская",
               "Дагестан", "Еврейская", "Забайкальский", "Ивановская","Ингушетия","Иркутская",
                "Кабардино-Балкария", "Калининградская", "Калмыкия", "Калужская", "Камчатский",
                "Карачаево-Черкесия", "Карелия", "Кемеровская", "Кировская", "Коми", "Костромская",
                "Краснодарский", "Красноярский", "Крым", "Курганская", "Курская", "Ленинградская",
               "Липецкая", "Магаданская", "Марий", "Мордовия", "Московская",
               "Мурманская", "Ненецкий", "Нижегородская", "Новгородская", "Новосибирская",
                "Омская", "Оренбургская", "Орловская", "Пензенская", "Пермский", "Приморский",
               "Псковская", "Ростовская", "Рязанская", "Самарская","Саратовская",
                 "Сахалинская", "Свердловская", "Северная", "Смоленская",
               "Ставропольский", "Тамбовская", "Татарстан", "Тверская", "Томская", "Тульская", "Тыва",
               "Тюменская", "Удмуртия", "Ульяновская", "Хабаровский", "Хакасия", "Ханты-Мансийский",
               "Челябинская", "Чечня", "Чувашия", "Чукотский", "Якутия", "Ямало-Ненецкий", "Ярославская"
               }
               
        
           
f = open('spisok.txt', 'r', encoding = 'utf-16')
d = dict()

while line := f.readline():
    line = line.replace('', '')
    r = line.split()
    for i in r:
        if i in oblasti:
            pos = r.index(i)
            obl = (' '.join(r[pos:]))
            city = (' '.join(r[:pos]))
            if obl in d:
                d[obl] += [city]
            else:
                d[obl] = [city]





    
    
